core/ome-completion.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Oh My Emacs Completion</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Oh My Emacs Completion"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-12-30T17:03+0800"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Oh My Emacs Completion</h1>

<p>This is part of the <a href="https://github.com/xiaohanyu/oh-my-emacs">oh-my-emacs</a>.
</p>

<div id="outline-container-completion-el-get-packages" class="outline-2">
<h2 id="completion-el-get-packages"><a name="sec-1" id="sec-1"></a>El-get Packages</h2>
<div class="outline-text-2" id="text-completion-el-get-packages">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption>El-get packages for ome-completion module</caption>
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left"></th><th scope="col" class="left">Status</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left"><a href="http://cx4a.org/software/auto-complete/">auto-complete</a></td><td class="left">Required</td><td class="left">I really like it.</td></tr>
<tr><td class="left"><a href="https://github.com/emacs-helm/helm">helm</a></td><td class="left">Required</td><td class="left">Completion everywhere, highly recommended.</td></tr>
<tr><td class="left"><a href="https://github.com/capitaomorte/yasnippet">YASnippet</a></td><td class="left">Required</td><td class="left">Quick snippet template insertion.</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Hippie expand</h2>
<div class="outline-text-2" id="text-2">

<p><code>M-x hippie-expand</code> is a single command providing a variety of completions and
expansions. The following code segment comes from <a href="https://github.com/bbatsov/prelude">Emacs Prelude</a>.
</p>



<pre class="example">;; hippie expand is dabbrev expand on steroids
(setq hippie-expand-try-functions-list '(try-expand-dabbrev
                                         try-expand-dabbrev-all-buffers
                                         try-expand-dabbrev-from-kill
                                         try-complete-file-name-partially
                                         try-complete-file-name
                                         try-expand-all-abbrevs
                                         try-expand-list
                                         try-expand-line
                                         try-complete-lisp-symbol-partially
                                         try-complete-lisp-symbol))
</pre>


</div>

</div>

<div id="outline-container-auto-complete" class="outline-2">
<h2 id="auto-complete"><a name="sec-3" id="sec-3"></a>Auto complete</h2>
<div class="outline-text-2" id="text-auto-complete">


<p>
<a href="http://cx4a.org/software/auto-complete/">Auto-Complete</a> is an intelligent auto-completion extension for Emacs. It extends
the standard Emacs completion interface and provides an environment that allows
users to concentrate more on their own work.
</p>
<p>
Actually, there're multiple completion packages for Emacs, say Emacs builtin
<a href="http://www.gnu.org/software/emacs/manual/html_node/elisp/Completion.html">completion</a>, there're <code>completion-at-point</code> function for <a href="http://www.gnu.org/software/emacs/manual/html_node/elisp/Completion-in-Buffers.html">completion in buffers</a>,
<a href="http://www.emacswiki.org/emacs/ProgrammableCompletion">pcomplete</a> for completion mainly for <code>comint-mode</code>, such as <a href="http://www.masteringemacs.org/articles/2012/01/16/pcomplete-context-sensitive-completion-emacs/">completion in Eshell</a>, <code>ido-mode</code> for completion in minibuffers. Say auto-complete, there's
also a <a href="http://stackoverflow.com/questions/4704748/emacs-completion-autocomplete-or-company">competitive</a> <a href="http://company-mode.github.io/">company-mode</a>.
</p>
<p>
By default, function <code>global-auto-complete-mode</code> will toggle on auto-complete
according to <code>ac-modes</code>, which in turn determines what major mode
<code>auto-complete-mode</code> can run on. Oh-my-emacs add <code>org-mode</code> and <code>text-mode</code> to
<code>ac-modes</code>.
</p>



<pre class="example">(defun ome-auto-complete-setup ()
  (require 'auto-complete-config)

  (dolist (ac-mode '(text-mode org-mode))
    (add-to-list 'ac-modes ac-mode))
  (dolist (ac-mode-hook '(text-mode-hook org-mode-hook prog-mode-hook))
    (add-hook ac-mode-hook
              (lambda ()
                (add-to-list 'ac-sources 'ac-source-files-in-current-dir)
                (add-to-list 'ac-sources 'ac-source-filename))))

  (ac-config-default))

(ome-install 'auto-complete)
</pre>



</div>

<div id="outline-container-ac-source-pcomplete" class="outline-3">
<h3 id="ac-source-pcomplete"><a name="sec-3-1" id="sec-3-1"></a>Integrate pcomplete with Auto-complete</h3>
<div class="outline-text-3" id="text-ac-source-pcomplete">


<p>
You may wonder why oh-my-emacs choose auto-complete? In a word, auto-complete
is flexible which provides a plugin mechanism through which you can define your
own <code>ac-source</code>, thus you get unlimited possibilities to complete in various
programming languages, major modes, etc.
</p>
<p>
The following code comes from <a href="http://www.emacswiki.org/emacs/EshellCompletion">EmacsWiki</a>, which defines a <code>ac-source-pcomplete</code>
that integrates pcomplete as a completion backend to auto-complete.
</p>



<pre class="example">(defun ac-pcomplete ()
  ;; eshell uses `insert-and-inherit' to insert a \t if no completion
  ;; can be found, but this must not happen as auto-complete source
  (flet ((insert-and-inherit (&amp;rest args)))
    ;; this code is stolen from `pcomplete' in pcomplete.el
    (let* (tramp-mode ;; do not automatically complete remote stuff
           (pcomplete-stub)
           (pcomplete-show-list t) ;; inhibit patterns like * being deleted
           pcomplete-seen pcomplete-norm-func
           pcomplete-args pcomplete-last pcomplete-index
           (pcomplete-autolist pcomplete-autolist)
           (pcomplete-suffix-list pcomplete-suffix-list)
           (candidates (pcomplete-completions))
           (beg (pcomplete-begin))
           ;; note, buffer text and completion argument may be
           ;; different because the buffer text may bet transformed
           ;; before being completed (e.g. variables like $HOME may be
           ;; expanded)
           (buftext (buffer-substring beg (point)))
           (arg (nth pcomplete-index pcomplete-args)))
      ;; we auto-complete only if the stub is non-empty and matches
      ;; the end of the buffer text
      (when (and (not (zerop (length pcomplete-stub)))
                 (or (string= pcomplete-stub ; Emacs 23
                              (substring buftext
                                         (max 0
                                              (- (length buftext)
                                                 (length pcomplete-stub)))))
                     (string= pcomplete-stub ; Emacs 24
                              (substring arg
                                         (max 0
                                              (- (length arg)
                                                 (length pcomplete-stub)))))))
        ;; Collect all possible completions for the stub. Note that
        ;; `candidates` may be a function, that's why we use
        ;; `all-completions`.
        (let* ((cnds (all-completions pcomplete-stub candidates))
               (bnds (completion-boundaries pcomplete-stub
                                            candidates
                                            nil
                                            ""))
               (skip (- (length pcomplete-stub) (car bnds))))
          ;; We replace the stub at the beginning of each candidate by
          ;; the real buffer content.
          (mapcar #'(lambda (cand) (concat buftext (substring cand skip)))
                  cnds))))))

(defvar ac-source-pcomplete
  '((candidates . ac-pcomplete)))
</pre>


</div>

</div>
