core/ome-completion.html

<div id="outline-container-auto-complete-usability-matrix" class="outline-3">
<h3 id="auto-complete-usability-matrix"><a name="sec-3-2" id="sec-3-2"></a>Auto-complete usability matrix</h3>
<div class="outline-text-3" id="text-auto-complete-usability-matrix">


<p>
Semantic completion based on <a href="http://cx4a.org/software/auto-complete/">auto-complete</a> is one of the major goals of
oh-my-emacs. The following matrix show the current status of oh-my-emacs
semantic completion.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="right" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left"></th><th scope="col" class="right">AC Usability</th><th scope="col" class="left">AC Backend</th><th scope="col" class="left">Detail</th></tr>
</thead>
<tbody>
<tr><td class="left">C/C++</td><td class="right">80%</td><td class="left"><a href="https://github.com/brianjcj/auto-complete-clang">auto-complete-clang</a></td><td class="left">Issue with function argument list.</td></tr>
<tr><td class="left">Python</td><td class="right">100%</td><td class="left"><a href="https://github.com/jorgenschaefer/elpy">elpy</a></td><td class="left">elpy is amazing.</td></tr>
<tr><td class="left">Emacs Lisp</td><td class="right">100%</td><td class="left">Builtin</td><td class="left">You kown that.</td></tr>
<tr><td class="left">Common Lisp</td><td class="right">100%</td><td class="left"><a href="https://github.com/purcell/ac-slime">ac-slime</a></td><td class="left">SLIME is amazing, too.</td></tr>
<tr><td class="left">Scheme</td><td class="right">80%</td><td class="left"><a href="https://github.com/xiaohanyu/ac-geiser">ac-geiser</a></td><td class="left">Yeah, I'm the author of ac-geiser.</td></tr>
<tr><td class="left">Clojure</td><td class="right">100%</td><td class="left"><a href="https://github.com/clojure-emacs/ac-nrepl">ac-nrepl</a></td><td class="left">It even completes Java!</td></tr>
</tbody>
</table>


</div>
</div>

</div>

<div id="outline-container-helm" class="outline-2">
<h2 id="helm"><a name="sec-4" id="sec-4"></a>Helm</h2>
<div class="outline-text-2" id="text-helm">


<p>
<a href="https://github.com/emacs-helm/helm">Helm</a> is a incremental completion and selection narrowing framework for
emacs. It will help steer you in the right direction when you're looking for
stuff in Emacs (like buffers, files, etc). Helm is a fork of <code>anything.el</code>,
which clean up the legacy code in <code>anything.el</code> and provide a cleaner and more
modular tool.
</p>
<p>
Actually, helm is not the only <a href="http://ergoemacs.org/emacs/emacs_name_completion.html">name completion packages in emacs</a>, there're
other choices&ndash;of course you always have choices in emacs, for example, the
builtin <a href="http://www.masteringemacs.org/articles/2010/10/10/introduction-to-ido-mode/">ido-mode</a> is quite a good choice. I also heard of <a href="http://www.emacswiki.org/emacs/Icicles">icicles</a> to be the most
powerful, but I found its documentatin really awkward. I choose helm since it
is easy to install and config, user-friendly, powerful enough and quite
intuitive to boost your workflow.
</p>
<p>
To wrap your mind around the helm way, you need to remember a few key
bindings. When helm starts, remember:
</p><ul>
<li>access the helm action menu with <code>TAB</code>. Maybe this is the most whirlwind
  turnaround since most name completion packages use <code>TAB</code> as completion
  key. Don't worry, helm doesn't need too much completion, since helm provides
  name completion by navigation instead by using <code>TAB</code> to complete character by
  character. Actually, the helm <code>TAB</code> brings you a new world, in which you
  combine several tasks into a series of successive keystrokes and get your job
  done.
</li>
<li>Use persistent actions with <code>C-z</code>.
</li>
<li>Mark candidate with <code>M-&lt;SPACE&gt;</code>, thus you can do batch processing through helm.
</li>
</ul>


<p>
The <a href="https://github.com/emacs-helm/helm/wiki">helm wiki</a> is a good place to explore this new world, but it's a little long
and not complete enough to cover all helm power. You can access helm functions
through the emacs menubar if want to use helm but don't want to remember too
much helm key bindings. Some shortcuts:
</p><ul>
<li><code>C-x c l</code>: <code>helm-locate</code>
</li>
<li><code>C-x c /</code>: <code>helm-find</code>
</li>
<li><code>C-x c f</code>: <code>helm-for-files</code>
</li>
<li><code>C-x c M-x</code>: <code>helm-M-x</code>
</li>
<li><code>C-x c a</code>: <code>helm-apropos</code>
</li>
<li><code>C-x c r</code>: <code>helm-regexp</code>
</li>
<li><code>C-x c c</code>: <code>helm-colors</code>
</li>
<li><code>C-x c 8</code>: <code>helm-ucs</code>
</li>
<li><code>C-x c i</code>: <code>helm-imenu</code>
</li>
<li><code>C-x c m</code>: <code>helm-man-woman</code>
</li>
<li><code>C-x c t</code>: <code>helm-top</code>
</li>
<li><code>C-x c p</code>: <code>helm-list-emacs-process</code>
</li>
<li><code>C-x c M-y</code>: <code>helm-show-kill-ring</code>
</li>
</ul>


<p>
To tell the truth, helm is one of my most favourite emacs packages. The more
you live with helm, the more you will find that you never want to come
back. Helm can replace many builtin or third-party emacs packages, or even
provide a better experience. For example, <code>helm-M-x</code> is a good competitor to
<a href="https://github.com/nonsequitur/smex">smex</a>, <code>helm-show-kill-ring</code> provides a better way to interact with emacs kill
ring than <a href="https://github.com/browse-kill-ring/browse-kill-ring">browse-kill-ring</a>. Helm integrates various external tools(such as
<code>grep</code>, <code>find</code>, <code>locate</code>, <code>md5sum</code>, <code>etags</code>, etc.) to emacs in a highly
intuitive and interactive way. Helm can even help you install debian apt
packages. If you have any question, just type <code>M-x helm-google-suggest</code> and
then helm will fire a web browser opening google for you at your fingertip.
</p>
<p>
To fully adopt helm power, I also set some custom helm keybindings in
oh-my-emacs, you can change it as you like. Of course you can disable helm at
all, then oh-my-emacs will use some other packages such as <code>ido-mode</code> as a
fallback. But I do suggest you to take some time to be familiar with helm.
</p>



<pre class="example">(defun ome-helm-setup ()
  (require 'helm-config)
  (setq helm-input-idle-delay 0.2)
  (helm-mode t)
  (global-set-key (kbd "C-x c g") 'helm-do-grep)
  (global-set-key (kbd "C-x c o") 'helm-occur)
  (global-set-key (kbd "M-x") 'helm-M-x)
  (global-set-key (kbd "C-x C-f") 'helm-find-files))

(ome-install 'helm)

</pre>

</div>

</div>
