core/ome-completion.html

<div id="outline-container-yasnippet" class="outline-2">
<h2 id="yasnippet"><a name="sec-5" id="sec-5"></a>Yasnippet</h2>
<div class="outline-text-2" id="text-yasnippet">


<p>
<a href="https://github.com/capitaomorte/yasnippet">YASnippet</a> is "Yet Another Snippet" expansion system for Emacs. It is inspired by
<a href="http://macromates.com/">TextMate</a>'s templating syntax. You can see the <a href="http://capitaomorte.github.io/yasnippet/">intro and tutorial</a> or watch this
<a href="http://www.youtube.com/watch?v=vOj7btx3ATg">video on youtube</a> to get some basic knowledge.
</p>
<p>
Oh-my-emacs do some hacks to <code>yas-prompt-functions</code>, it adopts <a href="https://github.com/m2ym/popup-el">popup</a>, a visual
popup interface library extracted from <a href="http://cx4a.org/software/auto-complete/">auto-complete</a> by its author. It has
better look and feel than all the built-in <code>yas-prompt-functions</code>. Also it is
easy to customize, and its isearch mode is very efficient, the items are
filtered on-the-fly when typing<sup><a class="footref" name="fnr-.1" href="#fn-.1">1</a></sup>.
</p>
<p>
TODO:
</p><ul>
<li>The bundled snippets from official yasnippet is considered frozen, so you
  should add your own snippets if you want more. Maybe <a href="https://github.com/AndreaCrotti/yasnippet-snippets">yasnippet-snippets</a> is a
  good starting point, but I think it's far from perfect, for example, the
  emacs-lisp snippet is not quite hard to use.
</li>
</ul>





<pre class="example">(eval-after-load 'popup
  '(progn
     (define-key popup-menu-keymap (kbd "M-n") 'popup-next)
     (define-key popup-menu-keymap (kbd "TAB") 'popup-next)
     (define-key popup-menu-keymap (kbd "&lt;tab&gt;") 'popup-next)
     (define-key popup-menu-keymap (kbd "&lt;backtab&gt;") 'popup-previous)
     (define-key popup-menu-keymap (kbd "M-p") 'popup-previous)))

(defun yas-popup-isearch-prompt (prompt choices &amp;optional display-fn)
  (when (featurep 'popup)
    (popup-menu*
     (mapcar
      (lambda (choice)
        (popup-make-item
         (or (and display-fn (funcall display-fn choice))
             choice)
         :value choice))
      choices)
     :prompt prompt
     ;; start isearch mode immediately
     :isearch t)))

(defun ome-yasnippet-setup ()
  (setq yas-prompt-functions
        '(yas-popup-isearch-prompt
          yas-no-prompt))
  (yas-reload-all)
  (add-hook 'prog-mode-hook
            '(lambda ()
               (yas-minor-mode))))

(ome-install 'popup)
(ome-install 'yasnippet)
</pre>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">Todo</h2>
<div class="outline-text-2" id="text-6">



</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1">Helm</h3>
<div class="outline-text-3" id="text-6-1">

<p>Ah, various ideas to enhance helm:
</p><ul>
<li>Provide a copy action which just copy the selected items. This is useful when
  you query a elisp command or function.
</li>
<li>Provide a doc action which show documentation of elisp function or commands.
</li>
<li>For helm-projectile, add full path to file list to differentiate same file
  name files.
</li>
</ul>


<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> <a href="http://iany.me/2012/03/use-popup-isearch-for-yasnippet-prompt/">http://iany.me/2012/03/use-popup-isearch-for-yasnippet-prompt/</a>
</p>


</div>
</div>
</div>

</div>
</div>
</div>

</body>
</html>
